app/Models/Question.php

select sum(`like`) as aggregate from `votes` where `votes`.`question_id` = 1 and `votes`.`question_id` is not null
---
    public function likes(): Attribute
    {
        return new Attribute(get: fn () => $this->votes()->sum('like'));

select sum(`unlike`) as aggregate from `votes` where `votes`.`question_id` = 1 and `votes`.`question_id` is not null
---
    public function unlikes(): Attribute
    {
        return new Attribute(get: fn () => $this->votes()->sum('unlike'));