app/Models/User.php

    public function like(Question $question): void
    {
        $this->votes()->updateOrCreate(
            ['question_id' => $question->id, ],
            [
                'like'   => 1,
                'unlike' => 0,
            ]
        );
---
insert into `votes` (`question_id`, `like`, `unlike`, `user_id`, `updated_at`, `created_at`) values (12, 1, 0, 1, '2023-12-04 18:13:44', '2023-12-04 18:13:44')
select * from `votes` where `votes`.`user_id` = 1 and `votes`.`user_id` is not null and (`question_id` = 12) limit 1